# Terraform environment prod
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wM2UwZWQzYi04NDQ3LTQyMGEtOTQyOS01NWU4MTNjNjRiMDU7b2JqZWN0SWQ9YTk1ODVhNjQtMjBmMC00ZDE4LWFiYTYtOTkzMGY5MmI4MDljO3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
data.azurerm_virtual_network.hub_vnet: Reading...
data.azurerm_private_dns_zone.hub_service_bus: Reading...
data.azurerm_private_dns_zone.key_vault: Reading...
data.azurerm_private_dns_zone.blob_storage: Reading...
data.azurerm_private_dns_zone.blob_storage: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net]
data.azurerm_private_dns_zone.key_vault: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net]
module.app_configuration.data.azurerm_resource_group.hub: Reading...
data.azurerm_private_dns_zone.hub_service_bus: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.servicebus.windows.net]
data.azurerm_virtual_network.hub_vnet: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/virtualNetworks/vnetaltinnauth001hub]
module.app_configuration.data.azurerm_resource_group.hub: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_role_assignment.admin_reader will be created
  + resource "azurerm_role_assignment" "admin_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "31b04051-ab3b-439d-b8fa-3e7b3f6b68ba"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_servicebus_namespace.service_bus will be updated in-place
  ~ resource "azurerm_servicebus_namespace" "service_bus" {
        id                                  = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001prod/providers/Microsoft.ServiceBus/namespaces/sbaltinnauth001prod"
        name                                = "sbaltinnauth001prod"
      ~ public_network_access_enabled       = false -> true
        tags                                = {
            "CreatedAt"   = "Tuesday, 02-Jan-18 23:12:01 UTC"
            "Environment" = "prod"
            "Instance"    = "001"
            "ProductName" = "auth"
        }
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_storage_container.lease will be created
  + resource "azurerm_storage_container" "lease" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "leases"
      + resource_manager_id               = (known after apply)
      + storage_account_id                = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001prod/providers/Microsoft.Storage/storageAccounts/staltinnauth001prod"
    }

Plan: 2 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @andreasisnes |
| Action | `workflow_dispatch` |
| Working Directory | `infra/deploy/spoke` |
| State File | `github.com/altinn/altinn-authorization-tmp/environments/prod/spokes.tfstate` |
| Plan File | `github.com_altinn_altinn-authorization-tmp_environments_prod_spokes.tfstate.tfplan`